const aboutUs = () => {

    return (
      <div className="flex flex-col items-center justify-center min-h-screen bg-gray-100">
        <div className="container mx-auto p-4">
          <h1 className="text-4xl font-bold mb-4 text-end w-full">
          معلومات عنا        
          {/* <button onClick={()=>handlesEdit()}><AiFillEdit/></button> */}
          </h1>
          <p className="text-lg text-gray-600 text-end">
          تم إطلاق العنوان الأول في تركيا للإعلانات والتسوق ،   في عام 2000 ضمن مجموعة أكسوي. إلى جانب كونه موقعًا للتجارة الإلكترونية ،   هو ممثل العملية منذ ولادة التجارة الإلكترونية في بلدنا حتى الوقت الحاضر ، وهو أحد أكبر منصات التجارة الإلكترونية والإعلان في تركيا.
تقديم الخدمات في 10 فئات ، وهي العقارات ، والمركبات ، والتسوق ، ومعدات البناء والصناعة ، وقطع الغيار - الملحقات - الأجهزة والضبط ، والخدمات ، وإعلانات الوظائف ، وعالم الحيوان ، والمعلمين والباحثين المساعدين ، يقدم   المنتجات والخدمات التي من شأنها جعل الحياة أسهل لمستخدميها ، كما حصل على العديد من الجوائز على الصعيدين الوطني والدولي مع خدماته.
  هي أيضًا أول شركة للتجارة الإلكترونية في تركيا يتم اختيارها كـ  ومقرها في اسطنبول ،  .
من خلال مواردها البشرية المهنية الشغوفة ، والبنية التحتية التكنولوجية القوية ونهج الخدمة الموجه نحو العملاء ، تواصل   العمل بكل قوتها لخلق قيمة من خلال لمس حياة مستخدميها ، ومساعدتهم على تحقيق أحلامهم ، وتقديم الأفضل خبرة.          </p>
        </div>
   
      </div>
    );
  };
  
  export default aboutUs;
  