const contentPolicy = () => {

    return (
      <div className="flex flex-col items-center justify-center min-h-screen bg-gray-100">
        <div className="container mx-auto p-4">
          <h1 className="text-4xl font-bold mb-4 text-end w-full">
          سياسة محتوى
        {/* <button onClick={()=>handlesEdit()}><AiFillEdit/></button> */}
          </h1>
          <p className="text-lg text-gray-600 text-end">
          في المادة 13 من المرسوم بقانون بشأن حماية العلامات التجارية رقم 556 ، بعنوان "استنفاد الحقوق الناشئة عن تسجيل العلامات التجارية" ، ورد أنه "بعد وضع علامة تجارية مسجلة على البضائع في نطاق التسجيل وتقديمها إلى السوق في تركيا من قبل مالك العلامة التجارية أو بإذنه / منها ، يتم استبعاد الإجراءات المتعلقة بالبضائع من تسجيل العلامات التجارية. تظل خارج نطاق الحق الناشئ "يسمى. في الواقع ، لا توجد عقبات قانونية أمام بيع المنتجات الأصلية التي كانت مملوكة بشكل قانوني.  نظرًا للبنية التحتية التقنية وتشغيل ، يتم تحديد المنتجات والإعلانات المباعة على الموقع من قبل المستخدمين ويتم تحديث الموقع في أي وقت. تماشياً مع سياسة إدارة الموقع ، تبذل شركتنا قصارى جهدها لمنع بيع المنتجات غير القانونية والتي من المحتمل أن تكون منتهكة ولإزالة الإعلانات ، وتجري باستمرار عمليات تفتيش وضوابط على الموقع من أجل اكتشاف المنتجات والإعلانات من هذا النوع ؛ ومع ذلك ، وكما ذكر أعلاه ، فإن التحديث المستمر لمحتوى المنتجات والإعلانات المباعة من قبل المستخدمين يتسبب في بيع المنتجات والإعلانات غير القانونية على الموقع من وقت لآخر ، على الرغم من جميع الضوابط. ومع ذلك ، لتجنب هذا الموقف ،  نتيجة للتحقيقات التفصيلية التي تم إجراؤها على الفور نتيجة للإخطارات الواردة من أصحاب الحقوق الخلفية ، يتم تحديد ما إذا كان الإعلان (الإعلانات) التي تنتمي إلى المنتج (المنتجات) التي يُزعم أنها تشكل انتهاكًا للحقوق المعروضة للبيع على موقعنا على الهواء ، وإذا كان هذا المحتوى متاحًا ، يتقرر أن المنتجات ذات الصلة تنتمي إلى المنتج (المنتجات) ، بهذه الطريقة ، لا يُسمح أبدًا بالاستخدام غير العادل وغير الملائم وغير المصرح به للعلامات التجارية وإساءة استخدام حقوق الملكية الفكرية على 
          </p>
        </div>
   
      </div>
    );
  };
  
  export default contentPolicy;
  