const termsOfUse = () => {

    return (
      <div className="flex flex-col items-center justify-center min-h-screen bg-gray-100">
        <div className="container mx-auto p-4">
          <h1 className="text-4xl font-bold mb-4 text-end w-full">
          شروط الاستخدام
        {/* <button onClick={()=>handlesEdit()}><AiFillEdit/></button> */}
          </h1>
          <p className="text-lg text-gray-600 text-end">
          لاستخدام موقع ، يرجى قراءة الشروط المكتوبة أدناه. من خلال زيارة موقع   و / أو استخدام تطبيقات الهاتف المحمول الخاصة به (سيشار إلى موقع الويب و / أو تطبيقات الهاتف المحمول فيما يلي باسم "البوابة") و / أو "صاحب الحساب" ، فقد قرأت هذه " شروط الاستخدام ، التي توافق عليها تمامًا وتعلن وتتعهد بأنك تفهم ، أنك تقبل دون قيد أو شرط جميع الأمور المحددة في "شروط الاستخدام" وفي "البوابة" والتي ستحدث بمرور الوقت ، وأنك لن تقدم أي اعتراضات أو دفاعات بخصوص كافة الأمور المحددة في "البوابة". إذا كنت لا تقبل هذه الشروط ، فيرجى التوقف عن استخدام "البوابة".
1.1 مالك هذه "البوابة" هو مالك BİLGİ TEKNOLOJİLERİ PAZARLAMA VE TİCARET A.Ş. (يشار إليه فيما بعد باسم "المالك"). الخدمات المعروضة على "البوابة" والمحددة في المادة 3 من "شروط الاستخدام" هذه مقدمة من " ".
1.2  يمكن "للمالك" تغيير "شروط الاستخدام" وأية معلومات و "محتوى" في "البوابة" في أي وقت دون أي إشعار أو إشعار إلى "المستخدم". سيتم نشر هذه التغييرات على " " بشكل دوري وستكون سارية المفعول في تاريخ النشر. يُعتبر كل شخص طبيعي أو اعتباري يستفيد من خدمات "البوابة" بدفع سعر معين أو مجانًا أو الوصول إلى "البوابة" بأي شكل من الأشكال ، موافقًا على "شروط الاستخدام" وأي تغييرات يتم إجراؤها بواسطة "   "إلى" شروط الاستخدام "هذه. يتم نشر "شروط الاستخدام" هذه على موقع الويب  ؛ الوصول ممكن لكل شخص طبيعي أو اعتباري باستخدام "البوابة".
2. التعاريف
"البوابة":  موقع الويب الذي تقدم فيه شركة   "خدماتها" ، والتي تتكون من اسم المجال  والمجالات الفرعية المتصلة باسم المجال هذا.
المستخدم:  كل شخص طبيعي أو اعتباري يدخل على "البوابة".
"صاحب الحساب":  "المستخدم" الذي لديه حساب على "البوابة" ويستفيد من الخدمات المقدمة ضمن "البوابة" ضمن الشروط المحددة في هذه الاتفاقية.
"خدمات  " ("الخدمة"):  التطبيقات التي تقدمها " " لتمكين "صاحب الحساب" داخل "البوابة" من تنفيذ الأعمال والمعاملات المحددة في هذه الاتفاقية. يجوز لـ " " إجراء تغييرات و / أو تعديلات على "الخدمات" المعروضة في "البوابة" في أي وقت. يتم الإعلان عن القواعد والشروط التي يلتزم "صاحب الحساب" بالامتثال لها فيما يتعلق بالتغييرات و / أو التعديلات التي تم إجراؤها إلى "صاحب الحساب" من "البوابة" ، وتدخل البنود والشروط المعلنة حيز التنفيذ في تاريخها. يتم نشرها على "البوابة".
"المحتوى":  أي معلومات ، أو نص ، أو ملف ، أو صورة ، أو فيديو ، أو شكل ، وما إلى ذلك منشورة على "البوابة" ويمكن الوصول إليها. الصور المرئية والمكتوبة والسمعية.
"واجهة المالك":  يستخدمها "المستخدمون" لغرض عرض المحتوى الذي أنشأه "المالك" و "صاحب الحساب" بواسطة "المستخدم" والاستعلام عنه من "قاعدة بيانات المالك" ؛ محمية بموجب القانون رقم 5846 بشأن الملكية الفكرية والأعمال الفنية وجميع مواقع الويب الفكرية التي تعطي أوامر لبرنامج الكمبيوتر لتنفيذ جميع أنواع العمليات التي يمكن إجراؤها من خلال "البوابة" ضمن التصميمات التي تخص ".
" قاعدة بيانات المالك":  هي قاعدة البيانات المحمية وفقًا للقانون رقم 5846 بشأن المصنفات الفكرية والفنية التابعة لشركة " " ، حيث يتم تخزين المحتويات التي يتم الوصول إليها في "البوابة" وتصنيفها والاستعلام عنها والوصول إليها.
3. خدمات من المالك
3.1. يضمن " " أن المحتويات التي تم تحميلها إلى "قاعدة بيانات  " بواسطة "صاحب الحساب" يمكن عرضها بواسطة "المستخدمين" عبر "قاعدة بيانات  " باستخدام الواجهات.
3.2 يوفر " " أنواعًا مختلفة من خدمات القوائم التي تعطي الأولوية لعرض الإعلانات من أجل تمكين "المستخدمين" من الوصول إلى إعلانات "صاحب الحساب" بسهولة أكبر داخل "البوابة".
3.3 يوفر " " خدمات إعداد التقارير ضمن فئات مختلفة للمعاملات التي تتم داخل "البوابة" وعدد المشاهدات.
3.4. تحتفظ " " بالحق في إضافة خدمات جديدة إلى الخدمات التي تقدمها داخل "البوابة" ، لتغيير نطاق وشروط التسليم للخدمات الحالية و "المحتوى" الذي يتم الوصول إليه داخل "البوابة" في أي وقت ، لإغلاق و حذف وصول الأطراف الثالثة. يمكن "للمالك" استخدام هذا الحق بأي طريقة يشاء ، دون إعطاء أي إشعار أو إعطاء أي إشعار.
4. الشروط والالتزامات المتعلقة باستخدام المالك للبوابة
4.1 يمكن "للمستخدمين" اتخاذ إجراء بشأن "البوابة" لأغراض مشروعة.
          </p>
        </div>
   
      </div>
    );
  };
  
  export default termsOfUse;
  